setupCoupledHouse/constant/region2d/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-100 0 0)		//0
    (0 0 0)		//1
    (40 0 0)	//2
    (90 0 0)		//3
    (-100 15 0)	//4
    (0 15 0)	//5
    (40 15 0)	//6
    (90 15 0)	//7
    (-100 30 0)		//8
    (0 30 0)		//9
    (40 30 0)	//10
    (90 30 0)		//11
    (-100 0 4)		//12
    (0 0 4)		//13
    (40 0 4)	//14
    (90 0 4)		//15
    (-100 15 4)	//16
    (0 15 4)	//17
    (40 15 4)	//18
    (90 15 4)	//19
    (-100 30 4)		//20
    (0 30 4)		//21
    (40 30 4)	//22
    (90 30 4)		//23

    (-100 -15 0)		//24
    (0 -15 0)		//25
    (40 -15 0)	//26
    (90 -15 0)		//27
    (-100 -15 4)		//28
    (0 -15 4)		//29
    (40 -15 4)	//30
    (90 -15 4)		//31
);

blocks
(
 /*----------------------------------------
   Order of blocks:
   
                 left

         | 1-3 | 2-3 | 3-3 |
  front  | 1-2 |     | 3-2 |  back
         | 1-1 | 2-1 | 3-1 |

                 right
------------------------------------------- */

    // 1-2
    hex (0 1 5 4 12 13 17 16) (120 75 1) 
    simpleGrading 
    (
     (
      (80 80 1)
      (18 30 0.2)
      (2 10 1)
     )
     1  // y-grading 
     1) // z-grading

    // 3-2
    hex (2 3 7 6 14 15 19 18) (70 75 1) 
    simpleGrading 
    (
     (
      (2 10 1)
      (18 30 5)
      (30 30 1)
     )
     1 
     1)

    // 1-3
    hex (4 5 9 8 16 17 21 20) (120 30 1) 
    simpleGrading 
    (
     (
      (80 80 1)
      (18 30 0.2)
      (2 10 1)
     )
    5 
    1)

    // 2-3
    hex (5 6 10 9 17 18 22 21) (200 30 1) simpleGrading (1 5 1)

    // 3-3
    hex (6 7 11 10 18 19 23 22) (70 30 1)
    simpleGrading 
    (
     (
      (2 10 1)
      (18 30 5)
      (30 30 1)
     )
     5 
     1)

    // 1-1
    hex (24 25 1 0 28 29 13 12) (120 30 1) 
    simpleGrading 
    (
     (
      (80 80 1)
      (18 30 0.2)
      (2 10 1)
     )
    0.2 
    1)

    // 2-1
    hex (25 26 2 1 29 30 14 13) (200 30 1) simpleGrading (1 0.2 1)

    // 3-1
    hex (26 27 3 2 30 31 15 14) (70 30 1)
    simpleGrading 
    (
     (
      (2 10 1)
      (18 30 5)
      (30 30 1)
     )
     0.2 
     1)    
);

edges
(
);

boundary
(
    frontOutCenter2d
    {
        type patch;
        faces
        (
            (0 12 16 4)
        );
    }
    frontOutSides2d
    {
        type patch;
        faces
        (
            (4 16 20 8)
	    (24 28 12 0)
        );
    }
    backOut2d
    {
        type patch;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
	    (3 15 31 27)
        );
    }
    rightOut2d
    {
        type patch;
        faces
        (
            (24 25 29 28)
            (25 26 30 29)
	    (26 27 31 30)
        );
    }
    leftOut2d
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }

    frontIn2d
    {
        type patch;
        faces
        (
            (1 5 17 13)
        );
    }

    backIn2d
    {
        type patch;
        faces
        (
            (2 14 18 6)
        );
    }

    leftIn2d
    {
        type patch;
        faces
        (
            (5 6 18 17)
        );
    }

    rightIn2d
    {
        type patch;
        faces
        (
            (1 13 14 2)
        );
    }

    bottom2d
    {
        type empty;
        faces
        (
            (0 1 25 24)
	    (0 4 5 1)
	    (4 8 9 5)
	    (1 2 26 25)
	    (5 9 10 6)
	    (2 3 27 26)
	    (2 6 7 3)
	    (6 10 11 7)
        );
    }
    top2d
    {
        type empty;
        faces
        (
	    (12 13 29 28)
	    (12 16 17 13)
	    (16 20 21 17)
	    (13 14 30 29)
	    (17 21 22 18)
	    (14 15 31 30)
	    (14 18 19 15)
	    (18 22 23 19)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
