setupCoupledHouse/constant/region3d/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.0153846/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    front
    {
        type            sifMappedPatch;
        nFaces          1650;
        startFace       927225;
	sampleMode      nearestPatchFace;
	sampleRegion    region2d;
	samplePatch     frontIn2d;
	offset          (0 0 0);
    }
    back
    {
        type            sifMappedPatch;
        nFaces          1650;
        startFace       928875;
	sampleMode      nearestPatchFace;
	sampleRegion    region2d;
	samplePatch     backIn2d;
	offset          (0 0 0);
    }
    right
    {
        type            sifMappedPatch;
        nFaces          4400;
        startFace       930525;
	sampleMode      nearestPatchFace;
	sampleRegion    region2d;
	samplePatch     rightIn2d;
	offset          (0 0 0);
    }
    left
    {
        type            sifMappedPatch;
        nFaces          4400;
        startFace       934925;
	sampleMode      nearestPatchFace;
	sampleRegion    region2d;
	samplePatch     leftIn2d;
	offset          (0 0 0);
    }
    houseFront
    {
        type            wall;
        nFaces          550;
        startFace       939325;
    }
    houseBack
    {
        type            wall;
        nFaces          550;
        startFace       939875;
    }
    houseLeft
    {
        type            wall;
        nFaces          550;
        startFace       940425;
    }
    houseRight
    {
        type            wall;
        nFaces          550;
        startFace       940975;
    }
    bottom
    {
        type            wall;
        nFaces          14375;
        startFace       941525;
    }
    top
    {
        type            patch;
        nFaces          14375;
        startFace       955900;
    }
)

// ************************************************************************* //
