setupCoupledHouse/constant/region2d/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dim_s    dim_s [0 0 1 0 0 0 0] 1.0;
dim_m    dim_m [0 1 0 0 0 0 0] 1.0;
g                g [0 1 -2 0 0 0 0] 9.81;
Hdry    Hdry [0 1 0 0 0 0 0] 0.001;
Hdry2    Hdry2 [0 1 0 0 0 0 0] 0.00101;
Cnu     Cnu [0 0 0 0 0 0 0] 0.07;
nutmax     nutmax [0 2 -1 0 0 0 0] 0.1;

// ************************************************************************* //
