setupCoupledHouse/0/region2d/HU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      HU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform (-0.01 0 0 ); 

boundaryField
{
    frontOutCenter2d
    {
        type            zeroGradient;
    }
    frontOutSides2d
    {
        type            zeroGradient;
    }
    backOut2d
    {
        type            fixedValue;
        value           uniform (-2.17460317 0 0);
	/*
        type            timeVaryingFlowRateInlet;
        fileName        "floodWave.dat";
        outOfBounds     clamp;
        value           uniform (0 0 0);
	*/
    }
    rightOut2d
    {
        type            slip;
    }
    leftOut2d
    {
        type            slip;
    }
    frontIn2d
    {
        type            sifDischarge;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        neighbourFieldName alpha1;
        value           uniform (0 0 0);
    }
    backIn2d
    {
        type            sifDischarge;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        neighbourFieldName alpha1;
        value           uniform (0 0 0);
    }
    leftIn2d
    {
        type            sifDischarge;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        neighbourFieldName alpha1;
        value           uniform (0 0 0);
    }
    rightIn2d
    {
        type            sifDischarge;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        neighbourFieldName alpha1;
        value           uniform (0 0 0);
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
}


// ************************************************************************* //
