setupCoupledHouse/0/region2d/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
37650
(
-0.4975
-0.4925
-0.4875
-0.4825
-0.4775
-0.4725
-0.4675
-0.4625
...
)
;

boundaryField
{
    frontOutCenter2d
    {
        type            zeroGradient;
    }
    frontOutSides2d
    {
        type            zeroGradient;
    }
    backOut2d
    {
        type            zeroGradient;
    }
    rightOut2d
    {
        type            zeroGradient;
    }
    leftOut2d
    {
        type            zeroGradient;
    }
    frontIn2d
    {
        type            zeroGradient;
    }
    backIn2d
    {
        type            zeroGradient;
    }
    leftIn2d
    {
        type            zeroGradient;
    }
    rightIn2d
    {
        type            zeroGradient;
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
}


// ************************************************************************* //
