setupCoupledHouse/0/region3d/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
316250
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    front
    {
        type            sifAlpha1;
        neighbourRegionName region2d;
        neighbourPatchName frontIn2d;
        neighbourFieldName H;
        K               K;
        value           uniform 0;
    }
    back
    {
        type            sifAlpha1;
        neighbourRegionName region2d;
        neighbourPatchName backIn2d;
        neighbourFieldName H;
        K               K;
        value           uniform 0;
    }
    right
    {
        type            sifAlpha1;
        neighbourRegionName region2d;
        neighbourPatchName rightIn2d;
        neighbourFieldName H;
        K               K;
        value           uniform 0;
    }
    left
    {
        type            sifAlpha1;
        neighbourRegionName region2d;
        neighbourPatchName leftIn2d;
        neighbourFieldName H;
        K               K;
        value           uniform 0;
    }
    houseFront
    {
        type            zeroGradient;
    }
    houseBack
    {
        type            zeroGradient;
    }
    houseLeft
    {
        type            zeroGradient;
    }
    houseRight
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
